logs_pics/wrkLogsPut.txt
Running 15s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.122ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  506.26us   2.31ms   61.92%
    Req/Sec     2.11k   173.09     2.56k    60.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.12ms
 75.000%    1.49ms
 90.000%    1.85ms
 99.000%    2.16ms
 99.900%    2.25ms
 99.990%    2.31ms
 99.999%    2.31ms
100.000%    2.31ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.120     0.000000            2         1.00
       0.424     0.100000          999         1.11
       0.633     0.200000         2000         1.25
       0.827     0.300000         2998         1.43
       0.989     0.400000         3998         1.67
       1.117     0.500000         4995         2.00
       1.176     0.550000         5498         2.22
       1.232     0.600000         6002         2.50
       1.299     0.650000         6499         2.86
       1.373     0.700000         6996         3.33
       1.485     0.750000         7493         4.00
       1.548     0.775000         7748         4.44
       1.605     0.800000         7994         5.00
       1.667     0.825000         8244         5.71
       1.728     0.850000         8492         6.67
       1.791     0.875000         8747         8.00
       1.822     0.887500         8868         8.89
       1.851     0.900000         8995        10.00
       1.880     0.912500         9116        11.43
       1.912     0.925000         9241        13.33
       1.948     0.937500         9367        16.00
       1.963     0.943750         9430        17.78
       1.983     0.950000         9491        20.00
       2.002     0.956250         9554        22.86
       2.026     0.962500         9618        26.67
       2.051     0.968750         9679        32.00
       2.063     0.971875         9710        35.56
       2.077     0.975000         9742        40.00
       2.099     0.978125         9776        45.71
       2.111     0.981250         9803        53.33
       2.131     0.984375         9834        64.00
       2.139     0.985938         9850        71.11
       2.151     0.987500         9872        80.00
       2.155     0.989062         9883        91.43
       2.165     0.990625         9899       106.67
       2.175     0.992188         9915       128.00
       2.179     0.992969         9922       142.22
       2.185     0.993750         9928       160.00
       2.193     0.994531         9937       182.86
       2.201     0.995313         9944       213.33
       2.209     0.996094         9951       256.00
       2.219     0.996484         9956       284.44
       2.223     0.996875         9960       320.00
       2.225     0.997266         9963       365.71
       2.229     0.997656         9967       426.67
       2.237     0.998047         9971       512.00
       2.241     0.998242         9973       568.89
       2.245     0.998437         9978       640.00
       2.245     0.998633         9978       731.43
       2.247     0.998828         9979       853.33
       2.253     0.999023         9981      1024.00
       2.257     0.999121         9983      1137.78
       2.257     0.999219         9983      1280.00
       2.275     0.999316         9984      1462.86
       2.279     0.999414         9985      1706.67
       2.287     0.999512         9986      2048.00
       2.287     0.999561         9986      2275.56
       2.297     0.999609         9987      2560.00
       2.297     0.999658         9987      2925.71
       2.309     0.999707         9988      3413.33
       2.309     0.999756         9988      4096.00
       2.309     0.999780         9988      4551.11
       2.313     0.999805         9990      5120.00
       2.313     1.000000         9990          inf
#[Mean    =        1.123, StdDeviation   =        0.506]
#[Max     =        2.312, Total count    =         9990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  211.00us
 75.000%  256.00us
 90.000%  277.00us
 99.000%  315.00us
 99.900%  351.00us
 99.990%  445.00us
 99.999%  459.00us
100.000%  459.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.051     0.000000            1         1.00
       0.136     0.100000         1040         1.11
       0.154     0.200000         2022         1.25
       0.173     0.300000         3025         1.43
       0.190     0.400000         4026         1.67
       0.211     0.500000         5025         2.00
       0.223     0.550000         5499         2.22
       0.233     0.600000         6007         2.50
       0.241     0.650000         6494         2.86
       0.249     0.700000         7023         3.33
       0.256     0.750000         7568         4.00
       0.259     0.775000         7794         4.44
       0.262     0.800000         8024         5.00
       0.265     0.825000         8277         5.71
       0.269     0.850000         8555         6.67
       0.272     0.875000         8754         8.00
       0.275     0.887500         8907         8.89
       0.277     0.900000         9011        10.00
       0.280     0.912500         9144        11.43
       0.283     0.925000         9245        13.33
       0.287     0.937500         9380        16.00
       0.289     0.943750         9449        17.78
       0.291     0.950000         9500        20.00
       0.293     0.956250         9562        22.86
       0.296     0.962500         9630        26.67
       0.299     0.968750         9691        32.00
       0.301     0.971875         9724        35.56
       0.302     0.975000         9745        40.00
       0.305     0.978125         9788        45.71
       0.307     0.981250         9814        53.33
       0.309     0.984375         9841        64.00
       0.310     0.985938         9853        71.11
       0.311     0.987500         9871        80.00
       0.313     0.989062         9882        91.43
       0.316     0.990625         9903       106.67
       0.318     0.992188         9912       128.00
       0.320     0.992969         9921       142.22
       0.322     0.993750         9930       160.00
       0.324     0.994531         9939       182.86
       0.326     0.995313         9944       213.33
       0.328     0.996094         9951       256.00
       0.330     0.996484         9956       284.44
       0.331     0.996875         9959       320.00
       0.336     0.997266         9964       365.71
       0.340     0.997656         9970       426.67
       0.343     0.998047         9971       512.00
       0.344     0.998242         9973       568.89
       0.346     0.998437         9976       640.00
       0.348     0.998633         9979       731.43
       0.348     0.998828         9979       853.33
       0.357     0.999023         9981      1024.00
       0.365     0.999121         9982      1137.78
       0.377     0.999219         9983      1280.00
       0.392     0.999316         9984      1462.86
       0.404     0.999414         9985      1706.67
       0.406     0.999512         9986      2048.00
       0.406     0.999561         9986      2275.56
       0.412     0.999609         9987      2560.00
       0.412     0.999658         9987      2925.71
       0.430     0.999707         9988      3413.33
       0.430     0.999756         9988      4096.00
       0.430     0.999780         9988      4551.11
       0.445     0.999805         9989      5120.00
       0.445     0.999829         9989      5851.43
       0.445     0.999854         9989      6826.67
       0.445     0.999878         9989      8192.00
       0.445     0.999890         9989      9102.22
       0.459     0.999902         9990     10240.00
       0.459     1.000000         9990          inf
#[Mean    =        0.210, StdDeviation   =        0.054]
#[Max     =        0.459, Total count    =         9990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29998 requests in 15.00s, 1.92MB read
Requests/sec:   1999.78
Transfer/sec:    130.84KB